{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_35/kernel", "shape": [17, 1028], "dtype": "float32"}, {"name": "dense_35/bias", "shape": [1028], "dtype": "float32"}, {"name": "layer_normalization_28/gamma", "shape": [1028], "dtype": "float32"}, {"name": "layer_normalization_28/beta", "shape": [1028], "dtype": "float32"}, {"name": "dense_36/kernel", "shape": [1028, 512], "dtype": "float32"}, {"name": "dense_36/bias", "shape": [512], "dtype": "float32"}, {"name": "layer_normalization_29/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer_normalization_29/beta", "shape": [512], "dtype": "float32"}, {"name": "dense_37/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_37/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_30/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_30/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_38/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_38/bias", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_31/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_31/beta", "shape": [128], "dtype": "float32"}, {"name": "dense_39/kernel", "shape": [1941, 4], "dtype": "float32"}, {"name": "dense_39/bias", "shape": [4], "dtype": "float32"}]}]}